modules/gateway/server/src/test/resources/com/l7tech/server/policy/resources/REQUEST_secure_conversation.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" actor="secure_span" soapenv:mustUnderstand="1"><wsu:Timestamp wsu:Id="Timestamp-1-1e06b7102821db954e7f047069ca82e4"><wsu:Created>2007-09-20T01:40:26.449775755Z</wsu:Created><wsu:Expires>2017-09-19T11:48:06.196Z</wsu:Expires></wsu:Timestamp><wssc:SecurityContextToken xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc"><wssc:Identifier>http://www.layer7tech.com/uuid/00000001</wssc:Identifier></wssc:SecurityContextToken><wssc:DerivedKeyToken xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc" wsu:Id="DerivedKey-Sig-0-9ae98e282d4a1362a9aee865d377c2d0" wssc:Algorithm="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk/p_sha1"><wsse:SecurityTokenReference><wsse:Reference URI="http://www.layer7tech.com/uuid/00000001" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/sct"></wsse:Reference></wsse:SecurityTokenReference><wssc:Generation>0</wssc:Generation><wssc:Length>16</wssc:Length><wssc:Label>WS-SecureConversation</wssc:Label><wsse:Nonce>CP2WlvKu6ACJ+tCuPh0ayQ==</wsse:Nonce></wssc:DerivedKeyToken><wssc:DerivedKeyToken xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc" wsu:Id="DerivedKeyToken-2-cbf80c264bf77493d5d8640dde6efcbe" wssc:Algorithm="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk/p_sha1"><wsse:SecurityTokenReference><wsse:Reference URI="http://www.layer7tech.com/uuid/00000001" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/sct"></wsse:Reference></wsse:SecurityTokenReference><wssc:Generation>0</wssc:Generation><wssc:Length>16</wssc:Length><wssc:Label>WS-SecureConversation</wssc:Label><wsse:Nonce>vvhPNcRNbrqXoif3wRqOCg==</wsse:Nonce></wssc:DerivedKeyToken><xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:DataReference URI="#Body-3-2c540e267881f3bfa2d46794d1848ecb"></xenc:DataReference></xenc:ReferenceList><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"></ds:SignatureMethod><ds:Reference URI="#Timestamp-1-1e06b7102821db954e7f047069ca82e4"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>ZzebPXDJzpEX23Y0bIcgA45eoSA=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>HdfDX0AbTXCvfB0JMJ+lNaHQW/0=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#DerivedKey-Sig-0-9ae98e282d4a1362a9aee865d377c2d0" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk"></wsse:Reference></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
    <soapenv:Body><EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Id="Body-3-2c540e267881f3bfa2d46794d1848ecb" Type="http://www.w3.org/2001/04/xmlenc#Content"><EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"></EncryptionMethod><dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference URI="#DerivedKeyToken-2-cbf80c264bf77493d5d8640dde6efcbe" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk"></wsse:Reference></wsse:SecurityTokenReference></dsig:KeyInfo><CipherData><CipherValue>76yjyCcmU4cXhmDMWmBWF9FzU0z3MRrrIp15W/De7guCmxnJ32z41pH9W40C4HXI2rq72e4h1PAXme56vzfCwYCD8oZusiFiHMhmKSpV5iUzQh/N8cvG3jP776uV0Brcm8soSixmtdOi+eRsBwCuJiDeNejBRgRXmgo3FuvpQ9n4hP2ZsWEf1n4RQ2G285rApG3dqHzt7ryyo3hCZ5I4qw==</CipherValue></CipherData></EncryptedData></soapenv:Body>
</soapenv:Envelope>